#include "EnemyMove.h"

//-----------------------------------------------
//âΩÇ‡ÇµÇ»Ç¢
void EMove_NoMotion::Move(ML::Vec2& pos)
{
	//Ç±Ç±Ç…ÅuâΩÇ‡ÇµÇ»Ç¢ÅvèàóùÇèëÇ≠
}

//-----------------------------------------------
//âEÇ…ï‡Ç≠
void EMove_WalkRight::Move(ML::Vec2& pos)
{
	++pos.x;
}

//-----------------------------------------------
//è„Ç…à⁄ìÆÇ∑ÇÈ
void EMove_Up::Move(ML::Vec2& pos)
{
	--pos.y;
}

//-----------------------------------------------
//â∫Ç…à⁄ìÆÇ∑ÇÈ
void EMove_Down::Move(ML::Vec2& pos)
{
	++pos.y;
}